window.people = [{"name":"Obaid Siddiqi","organization":"TIFR, TIFR Centre, NCBS","relevance":"Founding member, TIFR Molecular Biology Unit and NCBS"},
{"name":"Zakir Hussain","organization":"Aligarh Muslim University","relevance":"Refers O. Siddiqi to Indian Agricultural Research Institute in 1957 during his term at Aligarh Muslim University. "},
{"name":"Riayat Khan","organization":"Aligarh Muslim University","relevance":"Lecturer at Aligarh Muslim University who teaches O. Siddiqi and refers him to Indian Agricultural Research Institute in 1957"},
{"name":"M S Swaminathan","organization":"Indian Agricultural Research Institute","relevance":"Suggests a National Biological Laboratory in the early 1960s; Advises O. Siddiqi to go abroad to study after Siddiqi's wheat crop got destroyed in a hailstorm; In Planning Commission that reviews and approves NCBS proposal in 1980-85"},
{"name":"Milislav Demerec","organization":"Cold Spring Harbor","relevance":"O.Siddiqi hears his talk on bacterial genetics in Delhi in ~1956, in which Demerec introduces Guido Pontecorvo's work. Pontecorvo would become Siddiqi's PhD advisor."},
{"name":"Guido Pontecorvo","organization":"University of Glasgow","relevance":"PhD advisor to O. Siddiqi at Glasgow, between ~1957-61. A lifelong mentor and friend who introduces Siddiqi to a variety of researchers over the years"},
{"name":"Alan Garen","organization":"University of Pennsyvania, Philadelphia","relevance":"Post doctoral advisor and collaborator with O.Siddiqi in Philadelphia in the early 1960s."},
{"name":"Sydney Brenner","organization":"MRC Laboratory of Molecular Biology, Cambridge","relevance":"Met O.Siddiqi during his PhD years, and would become a lifelong collaborator and mentor for the work at TIFR's molecular biology unit and NCBS. "},
{"name":"Seymour Benzer","organization":"California Institute of Technology","relevance":"Works with O.Siddiqi in the late 1960s, to drive the neurobiology shift at TIFR. Would become a lifelong collaborator and mentor for the work at TIFR's molecular biology unit and NCBS. "},
{"name":"Maurice Fox","organization":"MIT","relevance":"Collaborator with O.Siddiqi, and introduces him to Jerry Lettvin in ~1970 (a neurobiology connection) and Leo Szilard (who would connect him to Homi Bhabha) in ~1961-62."},
{"name":"Evelyn Fox","organization":"MIT","relevance":"Collaborator with O.Siddiqi and historian of science. Introduces O.Siddiqi in ~1961-62 to Leo Szilard (who would connect him to Homi Bhabha)."},
{"name":"Leo Szilard","organization":"University of Chicago / Salk Institute","relevance":"Worked in the Manhattan Project; Knew Homi Bhabha well; In 1962, he forwards Bhabha the recommendation letters for O.Siddiqi that he received from Alan Garen and Guido Pontecorvo."},
{"name":"Rustom Choksi","organization":"Tata Trust","relevance":"Served in the Tata Trust for many decades, including in the crucial 1940s. Works with Homi Bhabha to develop a good proposal for the new institute in physics research, with suggestions on how to frame the letter to the Tata Trust. "},
{"name":"J R D Tata","organization":"Tata ","relevance":"Helped found the Tata Institute for Fundamental Research in 1945, following the proposal from Homi Bhabha. Works closely with Bhabha till his death. In a 1993 TIFR Council Meeting, advocates for many autonomous national centres branching out of TIFR."},
{"name":"A V Hill","organization":"Royal Society ","relevance":"Upon hearing from Homi Bhabha in 1944 of the new physics insitute, Hill replied with a prescient remark. “I think you had better take biophysics under its wing, too,” he said. “I am sure many of the most important future applications of physics will be in biology.”"},
{"name":"Homi Bhabha","organization":"Director, TIFR, 1944-1966","relevance":"Founder, TIFR. In 1962, upon receiving a set of recommendation letters for O.Siddiqi, he hires Siddiqi to set up molecular biology in TIFR. Also shapes Siddiqi's thinking on administration of science."},
{"name":"M G K Menon","organization":"Director, TIFR, 1966-1975","relevance":"Physicist and director, TIFR between 1966-76, and an advocate for Siddiqi's research / biology centre in later years."},
{"name":"B V Sreekantan","organization":"Director, TIFR, 1975-1987","relevance":"Makes the instrumental push for biology centre and various national centres of TIFR  between ~1980-1987 during time as director. Mentor to NCBS staff and member of NCBS project committees during construction phase. "},
{"name":"Virendra Singh","organization":"Director, TIFR, 1987-1997","relevance":"TIFR Director when NCBS officially starts operations in Bangalore; issued the first delegation of powers in 1992 for NCBS, paving way for considerable autonomy in the functioning of NCBS"},
{"name":"Sudhanshu Jha","organization":"Director, TIFR, 1997-2002","relevance":"TIFR director when NCBS moves to current campus. Dean of Physics faculty when NCBS was in the proposal stage."},
{"name":"Jerry Lettvin","organization":"MIT","relevance":"Neurophysiologist who interacts with O.Siddiqi at MIT through Maurice Fox in ~1969-70. One of the first to suggest that Siddiqi do molecular biology work on neurons"},
{"name":"Joel Brown","organization":"MIT","relevance":"Teaches neurobiology techniques to O.Siddiqi at MIT in ~1969-70. Part of his training in the new field, which he then introduces at TIFR and attracts a whole new line of work."},
{"name":"John Barnabas","organization":"Ahmednagar College, Mahabaleshwar","relevance":"Baranabas and Siddiqi start the Mahabaleshwar Seminars in mid 1970s: attracts teachers and students from across the country, building an identity for both the field and the institute."},
{"name":"David Suzuki","organization":"University of British Columbia","relevance":"Gives MIT talk on temperature-paralyzed mutants of Drosophila in ~1969. Influences O.Siddiqi to study that at Caltech with Seymour Benzer."},
{"name":"B V Krishnamurthy","organization":"Economist, World Bank","relevance":"In 1980s, Karnataka govt bans land for new science institutes inside Bangalore. Krishnamurthy suggests that TIFR look for land within existing institution. One of the steps that leads to current UAS campus."},
{"name":"Ram Naresh Singh","organization":"TIFR","relevance":"Moves from Trombay to TIFR MBU in 1960s to be one of the early faculty members who shape the trajectory of the group. Works on bacterial genetics and then specializes in neuroanatomy over the years."},
{"name":"Man Mohan Johri","organization":"TIFR","relevance":"Hired in TIFR MBU as one of the early faculty members who shape the trajectory of the group. Works on plant developmental biology and known for work on moss funaria. Also assists in land search for NCBS in the early days."},
{"name":"P K Maitra","organization":"TIFR","relevance":"First faculty hire in TIFR MBU after O.Siddiqi. Main work on yeast genetics. Big influence on many future TIFR and NCBS faculty."},
{"name":"M P Pitale","organization":"TIFR","relevance":"One of Siddiqi's first two hires in the molecular biology unit. Works as a scientific officer in the group till his retirement from TIFR."},
{"name":"Bal Apte","organization":"TIFR","relevance":"One of Siddiqi's first two hires in the molecular biology unit. First PhD student at TIFR MBU."},
{"name":"P N Bhavsar","organization":"TIFR","relevance":"Hired as lab assistant at TIFR MBU. Gets a masters degree while working as an assistant, and eventually publishes along with TIFR faculty. Takes up lab manager position (from Bombay) for NCBS in later years (1994)"},
{"name":"Udai Singh","organization":"TIFR","relevance":"Early faculty hire at TIFR MBU from the 1960s, shapes the trajectory of the group. specializing in biochemistry and also a brief stint in theoretical biology in the early 1980s."},
{"name":"Umakant Kenkare","organization":"TIFR","relevance":"Early TIFR MBU faculty (from 1965 to 1987) who works mainly on molecular enzymology and structural biochemistry. Shapes the trajectory of the group. "},
{"name":"M R Das","organization":"TIFR","relevance":"Lead work on virology/cancer at MBU in 1970s that got wide attention. Differing science priorities and other job offers prompt departure from TIFR in the late 1970s. Virology makes a return to TIFR/NCBS much later."},
{"name":"Zita Lobo","organization":"TIFR","relevance":"Research assistant at MBU who works with PK Maitra and completes her PhD at TIFR; later faculty in the group"},
{"name":"P Babu","organization":"TIFR","relevance":"Joins TIFR in 1961. Specializes in theoretical physics before joining the molecular biology unit in ~1973, and extensive work on C. elegans. Leaves TIFR in 1989 to start his own biotech company, which would eventually supply samples to NCBS."},
{"name":"B M Udgaonkar","organization":"TIFR","relevance":"Joins TIFR in 1949. Chair of theoretical physics group in the mid 1960s. Gets interested in problems of education and is founder of the Homi Bhabha Centre for Science Education (HBCSE) in 1974. HBCSE inspires other centres to start out of TIFR."},
{"name":"Vijay Sarathy","organization":"TIFR","relevance":"Publishes paper as student with O.Siddiqi in 1970s on DNA recombination, which would be read by Veronica Rodrigues and motivate her to reach out to TIFR."},
{"name":"K VijayRaghavan","organization":"TIFR, TIFR Centre, NCBS","relevance":"Cancels plans to go to Cornell after 1975 Emergency. Stays at IIT Kanpur for a masters. Then, defers plans to go for a PhD at ETH Zurich in 1977 after a tuberculosis bout. Captivated by an Obaid Siddiqi paper on neurogenetics while doing a temporary fellowship at AIIMS. Applies to TIFR for a PhD. Faculty and founding member, NCBS."},
{"name":"Veronica Rodrigues","organization":"TIFR, NCBS","relevance":"Student in Dublin who, after reading a TIFR paper on DNA recombination in the late 1970s, moves to India for her PhD. Publishes seminal work on drosophila neurobiology with O.Siddiqi and stays on as faculty at TIFR and NCBS till she passed away prematurely in 2010"},
{"name":"K S Krishnan","organization":"TIFR, NCBS","relevance":"After joining the BARC training School, reached out to O. Siddiqi [to work with him], who directs him to GN Ramachandran in IISc. Early faculty hire at TIFR MBU and known for his ability to bridge research across disciplines. Also known for ingenious innovations. Plays a crucial mentoring role for generations of students and faculty at TIFR and NCBS."},
{"name":"Sanjay Sane","organization":"TIFR, NCBS","relevance":"Joins TIFR/NCBS as one of the first few JRFs in the early 1990s after listening to a talk by K VijayRaghavan. Joins NCBS as faculty in 2007."},
{"name":"Champakali Ayyub","organization":"TIFR","relevance":"Starts as an assistant at TIFR MBU, and works closely with Veronica Rodrigues and O.Siddiqi on Drosophila neurobiology, and also one of the few scientific officers who completed her PhD at TIFR. "},
{"name":"C N R Rao","organization":"IISc","relevance":"Has conversations with O.Siddiqi and V. Singh on the biology centre. In 1989, he sends a letter to V. Singh inviting TIFR to set up a temporary lab at IISc while NCBS is getting built."},
{"name":"Vidyanand Nanjundiah","organization":"TIFR","relevance":"1980s faculty at TIFR MBU who works on developmental biology and a new model system for the group, slime mold. Also shapes the NCBS 1985-1990 proposal with O.Siddiqi. Helped NCBS initially in locating land in Bangalore"},
{"name":"Govind Swarup","organization":"TIFR","relevance":"Leads Giant Metrewave Radio Telescope (GMRT) project. GMRT and NCBS are part of the TIFR 1985-1990 proposal and are both approved by the Planning Commission. Close associate of O. Siddiqi at TIFR, and assists in Pune land search for NCBS."},
{"name":"S Ramaseshan","organization":"Director, IISc, 1970s","relevance":"Writes a letter to O.Siddiqi in 1978 suggesting that TIFR set up a biology centre in IISc"},
{"name":"H Sharat Chandra","organization":"IISc","relevance":"Major support for setting up of NCBS in Bangalore: Assists in reaching out to Govt of Karnataka and the GKVK at the highest level for allotting land to NCBS. Member of the founding Project Management Committee and Management Board."},
{"name":"T R Satish Chandran","organization":"Karnataka government, Institute for Social and Economic Change","relevance":"Feb 1987: Upon Sharat Chandra's request, suggests a possible location in Bangalore to O.Siddiqi; Early 1991: Instrumental in clearing final government hurdle by writing to Bangalore Deputy Commissioner explaining how TIFR is legally allowed to take the land being offered by UAS."},
{"name":"M R Srinivasan","organization":"Atomic Energy Commission","relevance":"Chairman of the Atomic Energy Commission during the time that the plans for NCBS are finalized in the early 1990s."},
{"name":"K Krishnamurthy","organization":"UAS","relevance":"Vice chancellor at UAS in 1989-92 period, when TIFR and UAS are finalizing the memorandum of undaerstanding, and when land was transferred to NCBS on long term lease."},
{"name":"P Balaram","organization":"IISc","relevance":"PhD advisor and collaborator with KS Krishnan and MK Mathew, who were early faculty at TIFR/NCBS. Associated with IISc since the 1970s, and its Director between 2005-2014. Invaluable observor of NCBS and guide over the years. Member of founding NCBS Management Board."},
{"name":"Gaiti Hasan","organization":"TIFR, TIFR Centre, NCBS","relevance":"Visits TIFR MBU for a brief stint in the 1970s, before joining as a research associate in the early 1980s. Moves from TIFR to be a founding faculty member of NCBS in the early 1990s."},
{"name":"Sudhir Krishna","organization":"TIFR, NCBS","relevance":"One of the first wave of faculty hires; joins in 1992. Fosters a bridge between biology and medicine."},
{"name":"T M Sahadevan","organization":"TIFR, TIFR Centre, NCBS","relevance":"Joins TIFR in the early 1970s, and navigates the administration for the mathematics, radio astronomy and finally, biological sciences groups' activities in Bangalore. Becomes an indispensable glue, especially in the early days of NCBS. "},
{"name":"Mathew K Mathew","organization":"TIFR, TIFR Centre, NCBS","relevance":"Founding faculty member of NCBS. Recruited after his post-doctoral work at Caltech/UCSF, where he meets Mani Ramaswami and K VijayRaghavan. Instrumental in implementing an academic curriculum on campus. Worked with the constructon team when GKVK campus was being built."},
{"name":"Mitradas Panicker","organization":"TIFR, TIFR Centre, NCBS","relevance":"One of the first wave of faculty hires; joins in 1992. Spent a summer at TIFR during Masters. Recruited after his post-doctoral work at UC Irvine and an interview with O.Siddiqi at Caltech. Worked with the construction team when the GKVK campus was being built."},
{"name":"Jayant Udgaonkar","organization":"TIFR, TIFR Centre, NCBS","relevance":"Founding faculty member of NCBS. Recruited after his post-doctoral work at Stanford in the late 1980s; had also worked under PK Maitra at TIFR during college. Also plays an instrumental role later as academic dean. Worked with the construction team when the GKVK campus was being built"},
{"name":"Mani Ramaswami","organization":"TIFR, NCBS","relevance":"Founding faculty member of NCBS. Recruited after his work at Caltech. Now at Trinity College, with continued collaboration at NCBS."},
{"name":"B R Somashekar","organization":"TIFR Centre, NCBS","relevance":"Gardener at TIFR Centre, and at NCBS. Retired in 2016. Visitors to IISc were said to comment on how much better the TIFR Centre landscaping looked compared to other centres on the IISc campus"},
{"name":"N. Shanthakumary","organization":"TIFR Centre, NCBS","relevance":"Joined TIFR Centre for work as a stenographer in 1983 and moved to NCBS after its formation. Early staff who got involved in all tasks, including accounting, office administration, scientific typing, revision of NCBS project cost and preparation of proposals. "},
{"name":"K S Vishalakshi","organization":"TIFR Centre, NCBS","relevance":"Joined GMRT project at TIFR Centre in a temporary dail wage position in 1986, before being hired formally in 1990. Moved to NCBS soon after its formation. Early staff who got involved in all tasks, including accounting, office administration, scientific typing, revision of NCBS project cost and preparation of proposals. "},
{"name":"U B Poornima","organization":"TIFR Centre, NCBS","relevance":"Hired as an architect for NCBS, first to realize the design of Raj Rewal's team, and then, to implement harmonious expansions of the campus."},
{"name":"R D John","organization":"NCBS","relevance":"Retired Chief engineer with experience working in large government projects in the Department of Space, Atomic Energy. Appointed in 1990 as advisor for campus design and construction activities. Shepherded initial additions at the TIFR Centre & design and construction of NCBS. Continues to play a pro bono advisory role."},
{"name":"Raj Rewal","organization":"Raj Rewal Associates","relevance":"Hired in 1993 for NCBS design after a survey of external architects, and based on a competition. Rewal had previously designed the National Institute of Immunology, Delhi. For NCBS, his team developed a landscaped concept with terraces and interlinked courtyards."},
{"name":"Meena Srinivasan","organization":"TIFR Centre","relevance":"Librarian at TIFR centre catering to both mathematics and biology."},
{"name":"S Umashashi","organization":"TIFR Centre, NCBS","relevance":"Temporary library staff hired for GMRT project at TIFR centre in late 1980s. Appointed as regular Library Assistant in 1990 after NCBS approval. Continues with NCBS Library."},
{"name":"Shaju Varghese","organization":"TIFR, TIFR Centre, NCBS","relevance":"Started as canteen supervisor at TIFR in the early 1980s. Hired to NCBS at TIFR Centre in the early 1990s. Starts canteen and kitchen with one stove. Currently responsible for hospitality, canteen, hostel, guest house and security in both main and Yelahanka campuses of NCBS."},
{"name":"Jeevaraju","organization":"TIFR Centre, NCBS","relevance":"Hired as daily wage worker to help with K VijayRaghavan's lab at the TIFR Centre. Becomes a single point contact for the lab in the early days, cleaning lab equipment, preparing fly food, help in their breeding. Is a major contractor for such services both for industry and institutions. Presently manages the lab kitchen."},
{"name":"K Madhava Raju","organization":"TIFR Centre ","relevance":"Hired to be first lab manager for NCBS at TIFR Cente in early 1991. This was the first (temporary) post advertised from Bangalore - internal circulation in the IISc campus. Trains initial daily wage workers who continue to maintain the lab kitchen today."},
{"name":"P P Ranjith","organization":"TIFR Centre, NCBS","relevance":"Joins NCBS in a temporary position for 6 months in 1995. Later hired as a "},
{"name":"T Venkatesh","organization":"TIFR Centre","relevance":"First purchase officer for NCBS. Handled all purchase and stores activities, service contracts and for an expanding set of activities."},
{"name":"V S Shailaja","organization":"TIFR Centre","relevance":"Assisted T Venkatesh, Purchase Officer, in all procurement, contracts in the initial days of NCBS"},
{"name":"K R Gopakumar","organization":"TIFR Centre","relevance":"First accountant hired by NCBS. In charge of accounts and assisting K A Nayar, NCBS Accounts Officer, who was also the Administrative Officer of the TIFR Centre"},
{"name":"B N R Prasanna","organization":"TIFR Centre","relevance":"Main engineer hired by NCBS in the early 1990s. Liaision with NCBS construction project carried out by the Civil, Engineering and Services groups of the Department of Atomic Energy, Kalpakkam."},
{"name":"Avinash Shenoy","organization":"TIFR Centre, NCBS","relevance":"The first IT systems manager at NCBS. Joined in early 1996 and remained perhaps the only IT guy for about two years. Also a time when NCBS started its push towards computational biology. Continues to be a consultant for NCBS computational needs."},
{"name":"P C Koteswara Rao","organization":"DAE","relevance":"Director (Civil) and chief civil and Strucural engineer for the NCBS construction project. The work was carried out by the Civil, Engineering and Services groups of the Department of Atomic Energy, Kalpakkam, with separate Directors for both."},
{"name":"B R Madan Mohan","organization":"DAE","relevance":"Additional chief engineer for the NCBS construction project. Work was carried out by the Civil, Engineering and Services groups of the Department of Atomic Energy, Kalpakkam. Initially took over NCBS work in addition to main responsibility for DAE works in Mysore. Upon retirement, moved full time to NCBS and stayed till completion of the project."},
{"name":"G K Madhava Rao","organization":"DAE","relevance":"Engineer in charge for all construction activities for the NCBS construction project. Among the senior-most engineers based at site. The work was carried out by the Civil, Engineering and Services groups of the Department of Atomic Energy, Kalpakkam."},
{"name":"S Shivaji Rao","organization":"DAE","relevance":"Structural design engineer for the entire NCBS construction project. The work was carried out by the Civil, Engineering and Services groups of the Department of Atomic Energy, Kalpakkam."},
{"name":"G Ravi Shankar","organization":"DAE","relevance":"One of the main civil engineers for the NCBS construction project. In charge of residential/dining areas. The work was carried out by the Civil, Engineering and Services groups of the Department of Atomic Energy, Kalpakkam. He continued briefly as Engineer in Charge for the Mandara campus. "},
{"name":"N S Srinivasan","organization":"DAE","relevance":"Electrical engineering, both design and supervision, for the NCBS construction project carried out by the Civil, Engineering and Services groups of the Department of Atomic Energy, Kalpakkam."},
{"name":"K Venkataraman","organization":"DAE","relevance":"Director of Engineering & Services group, which took care of design/supervision of all electrical/HVAC work for the NCBS construction project carried out by the Civil, Engineering and Services groups of the Department of Atomic Energy, Kalpakkam."},
{"name":"B Krishnamurthy","organization":"DAE","relevance":"Main electrical engineer at site for execution of HVAC for the NCBS construction project. It was carried out by the Civil, Engineering and Services groups of the Department of Atomic Energy, Kalpakkam."},
{"name":"K A Nayar","organization":"TIFR Centre","relevance":"Main administrative officer at TIFR Centre and first Accounts Officer of NCBS. Staff who worked for the mathematics group also started working for the new biology group that shared the TIFR Centre."},
{"name":"H R R Siddappa","organization":"TIFR Centre","relevance":"Attended to all electrical maintenance needs at TIFR Centre, including additions for new NCBS labs. Using the TIFR Centre workshop, he and N. Pandian built the first round of laboratory tables with provision for electrical points, wash basins, and any new additions."},
{"name":"N Pandian","organization":"TIFR Centre","relevance":"Was the point person for all sorts of maintenance issues at the TIFR Centre, especially with the new NCBS labs: plumbing, welding, fixing tables, creating partitions for labs."},
{"name":"P M Rathnakaran","organization":"TIFR Centre, NCBS","relevance":"One of the two main drivers at the TIFR Centre in the early 1990s. Moved to the new campus as the driver for the sole vehicle NCBS possessed at the time. Continues to be associated with NCBS."},
{"name":"K Sankaranarayanan","organization":"TIFR","relevance":"Registrar at TIFR when the NCBS project was approved.  Worked closely with O. Siddiqi, V. Singh & DAE. Supported in preparation and processing of project report, initial sanction orders, GKVK MoU approval, and later, first delegation orders that gave considerable autonomy to NCBS Centre Director."},
{"name":"H Krishnamurthy","organization":"IISc, NCBS","relevance":"As a researcher in NR Moudgal's group at IISc with expertise in flow cytometry, he assists some of the early work at the TIFR Centre. In the early 2000s, joins NCBS to set up an operator free facility for flow cytometry and imaging."},
{"name":"Ritu Khurana / Bhavana Shivu","organization":"NCBS","relevance":"First PhD student at NCBS. Worked with Jayant Udgaonkar, starting off first at TIFR and then moving to NCBS, much before anyone else."},
{"name":"Subhendu Sett ","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with MK Mathew."},
{"name":"Utpal Nath","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with Jayant Udgaonkar, and now faculty at IISc."},
{"name":"Preeta Guptan","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with MM Panicker."},
{"name":"Anuradha Sehgal","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with MM Panicker."},
{"name":"Raghu Padinjat","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with Gaiti Hasan. Now, a faculty member at NCBS."},
{"name":"Vishwas Agashe","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with Jayant Udgaonkar."},
{"name":"Baron Chanda","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with MK Mathew. Now a faculty at the University of Wisconsin Madison"},
{"name":"Vinay Tergaonkar","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with Sudhir Krishna. Now at Institute of Molecular and Cell Biology, Singapore."},
{"name":"R Annapoorni","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with Sudhir Krishna. Now faculty at IISc."},
{"name":"Suma Sundaresan","organization":"NCBS","relevance":"One of the first post doctoral researchers at NCBS. Worked with MM Panicker."},
{"name":"Sumita A Anant","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with K VijayRaghavan"},
{"name":"Betty Bagyam","organization":"NCBS","relevance":"One of the first teacher trainees hired at NCBS. Worked with Sudhir Krishna. Now at St Josephs College, and continues to be a connect with the college and NCBS."},
{"name":"Sudipto Roy","organization":"NCBS","relevance":"One of the first few PhD students at NCBS. Worked with K VijayRaghavan"},
{"name":"L S Shashidhara","organization":"NCBS","relevance":"One of the first few post doctoral hires for NCBS, starting in early 1993. Works with K VijayRaghavan. An early hands-free approach at NCBS allows him to apply for central government grants. Also now on NCBS board."},
{"name":"Anindya Sinha","organization":"NCBS","relevance":"One of the first few post doctoral hires for NCBS, starting in early 1993. Works with K VijayRaghavan. Would later be instrumental, along with Ajith Kumar, in bringing the MSc wildlife program into NCBS. This, in turn, attracts the attention of faculty in ecology."},
{"name":"Anita Hate","organization":"NCBS","relevance":"Possibly the first JRF at NCBS. Worked with Jayant Udgaonkar."},
{"name":"B V Shyamala","organization":"NCBS","relevance":"One of the first few post doctoral hires for NCBS, starting in early 1992. Works with K VijayRaghavan. "},
{"name":"Manisha Sinha","organization":"NCBS","relevance":"One of the first few JRFs at NCBS. Worked with Gaiti Hasan"},
{"name":"Srikala Raghavan","organization":"NCBS","relevance":"One of the first few JRFs at NCBS. Worked with K VijayRaghavan. Now faculty at InStem"},
{"name":"Nirupama Deshpande","organization":"NCBS","relevance":"One of the first few JRFs at NCBS. Worked with Sudhir Krishna"},
{"name":"K Venkatesh","organization":"NCBS","relevance":"One of the first few JRFs at NCBS. Worked with Gaiti Hasan"},
{"name":"B R Krishan","organization":"NCBS","relevance":"One of the first batch of JRFs at NCBS, in Jayant Udgaonkar's group. Now associated with K VijayRaghavan's group."},
{"name":"N Muralidhar","organization":"TIFR Centre","relevance":"Administrative Officer at TIFR Centre. Coordinated with Govt of Karnataka for NCBS land in GKVK campus. Help set up first laboratory for K. VijayRaghavan. After his transfer to Hyderabad, K.A. Nayar would take over his duties."},
{"name":"T N N Unni","organization":"TIFR Centre","relevance":"Assisted in general administration of NCBS, including correspondence, leave sanction/record, security and procurement, till a regular Purchase Officer joined for NCBS-specific work at the TIFR Centre."},
{"name":"V Ranganathan","organization":"DAE","relevance":"First Civil Engineer deputed by DAE construction group from Mumbai. Did the spot level surveys for the land in GKVK, helped with modifications and additions of building and facilities at the TIFR Centre"},
{"name":"N K Keshavamurthy","organization":"DAE","relevance":"First Civil Engineer deputed by DAE Construction Group from Kalpakkam. Involved with work on boundary walls, underground sumps and first substation."},
{"name":"P Desaiah","organization":"TIFR ","relevance":"Appointed on a short term basis under GMRT project at TIFR Centre. Moved to regular position around the NCBS approval time in 1990 as an all-purpose helper for the running of the new Centre. Remained with the Maths group when NCBS moved to GKVK campus."},
{"name":"Shobhona Sharma","organization":"TIFR","relevance":"Joins TIFR as a PhD student in the mid 1970s, and then again, as faculty in the late 1980s. Current chair of the Department of Biological Sciences at TIFR."},
{"name":"Rudra Naik","organization":"TIFR Centre, NCBS","relevance":"Moved to Bangalore in search of work and joined as assistant cook at TIFR Centre. Managed cafeteria for 8 yrs, knowing every person's beverage preference. Now part of guest house hopsitality staff."},
{"name":"","organization":"","relevance":""},
{"name":"Mukund Thattai","organization":"NCBS","relevance":"Faculty"},
{"name":"K S Madhumala","organization":"NCBS","relevance":"Post-doctoral researcher"},
{"name":"Sumantra Chattarji","organization":"NCBS","relevance":"One of the first 12 faculty hires at NCBS"},
{"name":"Upinder Bhalla","organization":"NCBS","relevance":"One of the first 12 faculty hires at NCBS"},
{"name":"Deepti Trivedi","organization":"NCBS","relevance":"Technology scientist; former student"},
{"name":"Aditi Bhattacharya","organization":"NCBS","relevance":"Research scientist; former student"},
{"name":"Kaleem Siddiqi","organization":"McGill University","relevance":""},
{"name":"MS Raghunathan","organization":"IIT Bombay","relevance":"Former faculty at TIFR"},
{"name":"Vidita Vaidya","organization":"TIFR","relevance":"Faculty"},
{"name":"BJ Rao","organization":"TIFR","relevance":"Faculty"},
{"name":"Shobha Jagtap","organization":"TIFR","relevance":"Staff; former administrative staff at the molecular biology unit"},
{"name":"Krishanu Ray","organization":"TIFR","relevance":"Faculty"},
{"name":"Taslimarif Saiyed","organization":"NCBS","relevance":"Director, C-CAMP"},
{"name":"Satyajit Mayor","organization":"NCBS","relevance":"One of the first 12 faculty hires at NCBS"},
{"name":"Ajith Kumar","organization":"NCBS","relevance":"Faculty; MSc Wildlife Program"},
{"name":"Maithreyi Narasimhan","organization":"TIFR","relevance":"Faculty"},
{"name":"Saurabh Mahajan","organization":"NCBS","relevance":"Student"},
{"name":"Uma Ramakrishnan","organization":"NCBS","relevance":"Faculty"},
{"name":"Anubhab Khan","organization":"NCBS","relevance":"Student"},
{"name":"Dilawar Singh","organization":"NCBS","relevance":"Student"},
{"name":"Debakshi Mallick","organization":"NCBS","relevance":"Student"},
{"name":"R. Sowdhamini","organization":"NCBS","relevance":"One of the first 12 faculty hires at NCBS"},
{"name":"Shannon Olsson","organization":"NCBS","relevance":"Faculty"},
{"name":"Dasaradhi Palakodeti","organization":"NCBS","relevance":"Faculty"},
{"name":"Prem Gautam Chandra","organization":"NCBS","relevance":"Staff; in charge of instrumentation division"},
{"name":"G Gajendra","organization":"NCBS","relevance":"Staff, fly facility"},
{"name":"Anand Kumar","organization":"NCBS","relevance":"Staff, reception"},
{"name":"Satyajit Rath","organization":"NII","relevance":"Faculty"},
{"name":"H Mohan","organization":"NCBS","relevance":"Staff, Animal House"},
{"name":"T Eswar","organization":"NCBS","relevance":"Staff, Canteen"},
{"name":"S N Basha","organization":"NCBS","relevance":"Staff, Security"},
{"name":"H Bhagya","organization":"NCBS","relevance":"Staff, Janitorial Services"},
{"name":"Villoo Patel","organization":"Avesthagen","relevance":"Former NCBS researcher who started a company at the TIFR Centre campus for NCBS"},
{"name":"R Parvathi","organization":"NCBS","relevance":"Staff, Dolna creche"},
{"name":"Mrinalini Puranik","organization":"Hindustan Lever","relevance":"Former faculty at NCBS"},
{"name":"Ashok Rao","organization":"NCBS","relevance":"Staff, administrative officer"}]